Revit 2027 API
Viewport.LabelLineLength Property
 The length of the viewport label line in sheet space, measured in feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LabelLineLength { get; set; }
Public Property LabelLineLength As Double
	Get
	Set
public:
property double LabelLineLength {
	double get ();
	void set (double value);
}
member LabelLineLength : float with get, set
Property Value
Double
Remarks
 It can be negative. The sign depends on the direction of the label line.
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace